app/views/tweeets/_profile.html.erb

SELECT COUNT(*) FROM "tweeets" WHERE "tweeets"."user_id" = ?  [["user_id", 1]]
---
						<p class="heading">Posts</p>
						<p class="title is-6"><%= current_user.tweeets.count %></p>

SELECT COUNT(*) FROM "users"
---
						<p class="heading">Total users</p>
						<p class="title is-6"><%= User.all.count %></p>